---
kind: property
id: P:Autodesk.Revit.DB.Plumbing.Pipe.PipeType
zh: 管道、水管、管线
source: html/cd80f438-0548-0863-b483-06cc678bd2b3.htm
---
# Autodesk.Revit.DB.Plumbing.Pipe.PipeType Property

**中文**: 管道、水管、管线

The pipe type of this pipe.

## Syntax (C#)
```csharp
public PipeType PipeType { get; set; }
```